Tekla Open API Reference for Tekla Structures 2025
Picker.PickLine Method
Overload List
Name | Description
PickLine()
 Queries the user to pick a line from the model.
PickLine(String)
 Queries the user to pick a line from the model with the given prompt.
Top
See Also
Reference
Picker Class
Tekla.Structures.Model.UI Namespace